syabyr/micropython/ports/efr32mg1p/pin_defs.h
/*
 * Pin definitions for EFR32MG1P
 * This file is included directly into the pins array definition in pin.c
 */
#include "em_gpio.h"


// GPIOA (0-7)
{ gpioPortA, 0, 0, NO_PWM },
{ gpioPortA, 1, 1, NO_PWM },
{ gpioPortA, 2, 2, NO_PWM },
{ gpioPortA, 3, 3, NO_PWM },
{ gpioPortA, 4, 4, NO_PWM },
{ gpioPortA, 5, 5, NO_PWM },
{ gpioPortA, 6, 6, NO_PWM },
{ gpioPortA, 7, 7, NO_PWM },

// GPIOB (8-15)
{ gpioPortB, 0, 8, NO_PWM },
{ gpioPortB, 1, 9, NO_PWM },
{ gpioPortB, 2, 10, NO_PWM },
{ gpioPortB, 3, 11, NO_PWM },
{ gpioPortB, 4, 12, NO_PWM },
{ gpioPortB, 5, 13, NO_PWM },
{ gpioPortB, 6, 14, NO_PWM },
{ gpioPortB, 7, 15, NO_PWM },

// GPIOC (16-23)
{ gpioPortC, 0, 16, NO_PWM },
{ gpioPortC, 1, 17, NO_PWM },
{ gpioPortC, 2, 18, NO_PWM },
{ gpioPortC, 3, 19, NO_PWM },
{ gpioPortC, 4, 20, NO_PWM },
{ gpioPortC, 5, 21, NO_PWM },
{ gpioPortC, 6, 22, NO_PWM },
{ gpioPortC, 7, 23, NO_PWM },

// GPIOD (24-31)
{ gpioPortD, 0, 24, NO_PWM },
{ gpioPortD, 1, 25, NO_PWM },
{ gpioPortD, 2, 26, NO_PWM },
{ gpioPortD, 3, 27, NO_PWM },
{ gpioPortD, 4, 28, NO_PWM },
{ gpioPortD, 5, 29, NO_PWM },
{ gpioPortD, 6, 30, NO_PWM },
{ gpioPortD, 7, 31, NO_PWM },

